## OpenTofu Plan: management

```

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

OpenTofu will perform the following actions:

  # azurerm_management_lock.law_platform_logs_archive_sea_01_cannot_delete will be destroyed
  # (because azurerm_management_lock.law_platform_logs_archive_sea_01_cannot_delete is not in configuration)
  - resource "azurerm_management_lock" "law_platform_logs_archive_sea_01_cannot_delete" {
      - id         = "/subscriptions/a998a203-5e24-4c8d-b2d2-536f14f7bf87/resourceGroups/rg-platform-logs-sea/providers/Microsoft.OperationalInsights/workspaces/law-platform-logs-sea-01/providers/Microsoft.Authorization/locks/lock-law-platform-logs-sea-01-cannot-delete" -> null
      - lock_level = "CanNotDelete" -> null
      - name       = "lock-law-platform-logs-sea-01-cannot-delete" -> null
      - scope      = "/subscriptions/a998a203-5e24-4c8d-b2d2-536f14f7bf87/resourceGroups/rg-platform-logs-sea/providers/Microsoft.OperationalInsights/workspaces/law-platform-logs-sea-01" -> null
    }

  # azurerm_storage_account.platform_logs_archive_sea_01 is tainted, so it must be replaced
-/+ resource "azurerm_storage_account" "platform_logs_archive_sea_01" {
      ~ id                                 = "/subscriptions/a998a203-5e24-4c8d-b2d2-536f14f7bf87/resourceGroups/rg-platform-logs-sea/providers/Microsoft.Storage/storageAccounts/stknccrsntplgasea01" -> (known after apply)
        name                               = (sensitive value)
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      ~ primary_blob_endpoint              = "https://stknccrsntplgasea01.blob.core.windows.net/" -> (known after apply)
      ~ primary_blob_host                  = "stknccrsntplgasea01.blob.core.windows.net" -> (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      ~ primary_dfs_endpoint               = "https://stknccrsntplgasea01.dfs.core.windows.net/" -> (known after apply)
      ~ primary_dfs_host                   = "stknccrsntplgasea01.dfs.core.windows.net" -> (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      ~ primary_file_endpoint              = "https://stknccrsntplgasea01.file.core.windows.net/" -> (known after apply)
      ~ primary_file_host                  = "stknccrsntplgasea01.file.core.windows.net" -> (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      ~ primary_location                   = "southeastasia" -> (known after apply)
      ~ primary_queue_endpoint             = "https://stknccrsntplgasea01.queue.core.windows.net/" -> (known after apply)
      ~ primary_queue_host                 = "stknccrsntplgasea01.queue.core.windows.net" -> (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      ~ primary_table_endpoint             = "https://stknccrsntplgasea01.table.core.windows.net/" -> (known after apply)
      ~ primary_table_host                 = "stknccrsntplgasea01.table.core.windows.net" -> (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      ~ primary_web_endpoint               = "https://stknccrsntplgasea01.z23.web.core.windows.net/" -> (known after apply)
      ~ primary_web_host                   = "stknccrsntplgasea01.z23.web.core.windows.net" -> (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
        tags                               = {
            "costcenter" = "cc-it-platform"
            "env"        = "shared"
            "iac_tool"   = "opentofu"
            "managed_by" = "iac"
            "org"        = "kneadcode"
            "owner"      = "platform-engineering"
            "portfolio"  = "coruscant"
            "purpose"    = "platform-logs-archive"
            "workload"   = "platform-logs"
        }
        # (22 unchanged attributes hidden)

      ~ blob_properties {
          - change_feed_retention_in_days = 0 -> null
          + default_service_version       = (known after apply)
          ~ versioning_enabled            = true -> false
            # (2 unchanged attributes hidden)

          + container_delete_retention_policy {
              + days = 7
            }

          + delete_retention_policy {
              + days                     = 7
              + permanent_delete_enabled = false
            }
        }

      ~ identity {
          - identity_ids = [] -> null
          ~ principal_id = "16a32320-e2ee-4a56-a495-5e147383605b" -> (known after apply)
          ~ tenant_id    = "7ba436b3-340f-4c81-8cd6-2600302173a4" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      + network_rules {
          + bypass                     = [
              + "AzureServices",
            ]
          + default_action             = "Allow"
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)
        }

      ~ queue_properties {
          + access_tier                        = (known after apply)
          + account_kind                       = (known after apply)
          + account_replication_type           = (known after apply)
          + account_tier                       = (known after apply)
          + allow_nested_items_to_be_public    = (known after apply)
          + allowed_copy_scope                 = (known after apply)
          + cross_tenant_replication_enabled   = (known after apply)
          + default_to_oauth_authentication    = (known after apply)
          + dns_endpoint_type                  = (known after apply)
          + edge_zone                          = (known after apply)
          + https_traffic_only_enabled         = (known after apply)
          + id                                 = (known after apply)
          + infrastructure_encryption_enabled  = (known after apply)
          + is_hns_enabled                     = (known after apply)
          + large_file_share_enabled           = (known after apply)
          + local_user_enabled                 = (known after apply)
          + location                           = (known after apply)
          + min_tls_version                    = (known after apply)
          + name                               = (known after apply)
          + nfsv3_enabled                      = (known after apply)
          + primary_access_key                 = (known after apply)
          + primary_blob_connection_string     = (known after apply)
          + primary_blob_endpoint              = (known after apply)
          + primary_blob_host                  = (known after apply)
          + primary_blob_internet_endpoint     = (known after apply)
          + primary_blob_internet_host         = (known after apply)
          + primary_blob_microsoft_endpoint    = (known after apply)
          + primary_blob_microsoft_host        = (known after apply)
          + primary_connection_string          = (known after apply)
          + primary_dfs_endpoint               = (known after apply)
          + primary_dfs_host                   = (known after apply)
          + primary_dfs_internet_endpoint      = (known after apply)
          + primary_dfs_internet_host          = (known after apply)
          + primary_dfs_microsoft_endpoint     = (known after apply)
          + primary_dfs_microsoft_host         = (known after apply)
          + primary_file_endpoint              = (known after apply)
          + primary_file_host                  = (known after apply)
          + primary_file_internet_endpoint     = (known after apply)
          + primary_file_internet_host         = (known after apply)
          + primary_file_microsoft_endpoint    = (known after apply)
          + primary_file_microsoft_host        = (known after apply)
          + primary_location                   = (known after apply)
          + primary_queue_endpoint             = (known after apply)
          + primary_queue_host                 = (known after apply)
          + primary_queue_microsoft_endpoint   = (known after apply)
          + primary_queue_microsoft_host       = (known after apply)
          + primary_table_endpoint             = (known after apply)
          + primary_table_host                 = (known after apply)
          + primary_table_microsoft_endpoint   = (known after apply)
          + primary_table_microsoft_host       = (known after apply)
          + primary_web_endpoint               = (known after apply)
          + primary_web_host                   = (known after apply)
          + primary_web_internet_endpoint      = (known after apply)
          + primary_web_internet_host          = (known after apply)
          + primary_web_microsoft_endpoint     = (known after apply)
          + primary_web_microsoft_host         = (known after apply)
          + provisioned_billing_model_version  = (known after apply)
          + public_network_access_enabled      = (known after apply)
          + queue_encryption_key_type          = (known after apply)
          + resource_group_name                = (known after apply)
          + secondary_access_key               = (known after apply)
          + secondary_blob_connection_string   = (known after apply)
          + secondary_blob_endpoint            = (known after apply)
          + secondary_blob_host                = (known after apply)
          + secondary_blob_internet_endpoint   = (known after apply)
          + secondary_blob_internet_host       = (known after apply)
          + secondary_blob_microsoft_endpoint  = (known after apply)
          + secondary_blob_microsoft_host      = (known after apply)
          + secondary_connection_string        = (known after apply)
          + secondary_dfs_endpoint             = (known after apply)
          + secondary_dfs_host                 = (known after apply)
          + secondary_dfs_internet_endpoint    = (known after apply)
          + secondary_dfs_internet_host        = (known after apply)
          + secondary_dfs_microsoft_endpoint   = (known after apply)
          + secondary_dfs_microsoft_host       = (known after apply)
          + secondary_file_endpoint            = (known after apply)
          + secondary_file_host                = (known after apply)
          + secondary_file_internet_endpoint   = (known after apply)
          + secondary_file_internet_host       = (known after apply)
          + secondary_file_microsoft_endpoint  = (known after apply)
          + secondary_file_microsoft_host      = (known after apply)
          + secondary_location                 = (known after apply)
          + secondary_queue_endpoint           = (known after apply)
          + secondary_queue_host               = (known after apply)
          + secondary_queue_microsoft_endpoint = (known after apply)
          + secondary_queue_microsoft_host     = (known after apply)
          + secondary_table_endpoint           = (known after apply)
          + secondary_table_host               = (known after apply)
          + secondary_table_microsoft_endpoint = (known after apply)
          + secondary_table_microsoft_host     = (known after apply)
          + secondary_web_endpoint             = (known after apply)
          + secondary_web_host                 = (known after apply)
          + secondary_web_internet_endpoint    = (known after apply)
          + secondary_web_internet_host        = (known after apply)
          + secondary_web_microsoft_endpoint   = (known after apply)
          + secondary_web_microsoft_host       = (known after apply)
          + sftp_enabled                       = (known after apply)
          + shared_access_key_enabled          = (known after apply)
          + table_encryption_key_type          = (known after apply)
          + tags                               = (known after apply)
        } -> (known after apply)

      ~ share_properties {
          + access_tier                        = (known after apply)
          + account_kind                       = (known after apply)
          + account_replication_type           = (known after apply)
          + account_tier                       = (known after apply)
          + allow_nested_items_to_be_public    = (known after apply)
          + allowed_copy_scope                 = (known after apply)
          + cross_tenant_replication_enabled   = (known after apply)
          + default_to_oauth_authentication    = (known after apply)
          + dns_endpoint_type                  = (known after apply)
          + edge_zone                          = (known after apply)
          + https_traffic_only_enabled         = (known after apply)
          + id                                 = (known after apply)
          + infrastructure_encryption_enabled  = (known after apply)
          + is_hns_enabled                     = (known after apply)
          + large_file_share_enabled           = (known after apply)
          + local_user_enabled                 = (known after apply)
          + location                           = (known after apply)
          + min_tls_version                    = (known after apply)
          + name                               = (known after apply)
          + nfsv3_enabled                      = (known after apply)
          + primary_access_key                 = (known after apply)
          + primary_blob_connection_string     = (known after apply)
          + primary_blob_endpoint              = (known after apply)
          + primary_blob_host                  = (known after apply)
          + primary_blob_internet_endpoint     = (known after apply)
          + primary_blob_internet_host         = (known after apply)
          + primary_blob_microsoft_endpoint    = (known after apply)
          + primary_blob_microsoft_host        = (known after apply)
          + primary_connection_string          = (known after apply)
          + primary_dfs_endpoint               = (known after apply)
          + primary_dfs_host                   = (known after apply)
          + primary_dfs_internet_endpoint      = (known after apply)
          + primary_dfs_internet_host          = (known after apply)
          + primary_dfs_microsoft_endpoint     = (known after apply)
          + primary_dfs_microsoft_host         = (known after apply)
          + primary_file_endpoint              = (known after apply)
          + primary_file_host                  = (known after apply)
          + primary_file_internet_endpoint     = (known after apply)
          + primary_file_internet_host         = (known after apply)
          + primary_file_microsoft_endpoint    = (known after apply)
          + primary_file_microsoft_host        = (known after apply)
          + primary_location                   = (known after apply)
          + primary_queue_endpoint             = (known after apply)
          + primary_queue_host                 = (known after apply)
          + primary_queue_microsoft_endpoint   = (known after apply)
          + primary_queue_microsoft_host       = (known after apply)
          + primary_table_endpoint             = (known after apply)
          + primary_table_host                 = (known after apply)
          + primary_table_microsoft_endpoint   = (known after apply)
          + primary_table_microsoft_host       = (known after apply)
          + primary_web_endpoint               = (known after apply)
          + primary_web_host                   = (known after apply)
          + primary_web_internet_endpoint      = (known after apply)
          + primary_web_internet_host          = (known after apply)
          + primary_web_microsoft_endpoint     = (known after apply)
          + primary_web_microsoft_host         = (known after apply)
          + provisioned_billing_model_version  = (known after apply)
          + public_network_access_enabled      = (known after apply)
          + queue_encryption_key_type          = (known after apply)
          + resource_group_name                = (known after apply)
          + secondary_access_key               = (known after apply)
          + secondary_blob_connection_string   = (known after apply)
          + secondary_blob_endpoint            = (known after apply)
          + secondary_blob_host                = (known after apply)
          + secondary_blob_internet_endpoint   = (known after apply)
          + secondary_blob_internet_host       = (known after apply)
          + secondary_blob_microsoft_endpoint  = (known after apply)
          + secondary_blob_microsoft_host      = (known after apply)
          + secondary_connection_string        = (known after apply)
          + secondary_dfs_endpoint             = (known after apply)
          + secondary_dfs_host                 = (known after apply)
          + secondary_dfs_internet_endpoint    = (known after apply)
          + secondary_dfs_internet_host        = (known after apply)
          + secondary_dfs_microsoft_endpoint   = (known after apply)
          + secondary_dfs_microsoft_host       = (known after apply)
          + secondary_file_endpoint            = (known after apply)
          + secondary_file_host                = (known after apply)
          + secondary_file_internet_endpoint   = (known after apply)
          + secondary_file_internet_host       = (known after apply)
          + secondary_file_microsoft_endpoint  = (known after apply)
          + secondary_file_microsoft_host      = (known after apply)
          + secondary_location                 = (known after apply)
          + secondary_queue_endpoint           = (known after apply)
          + secondary_queue_host               = (known after apply)
          + secondary_queue_microsoft_endpoint = (known after apply)
          + secondary_queue_microsoft_host     = (known after apply)
          + secondary_table_endpoint           = (known after apply)
          + secondary_table_host               = (known after apply)
          + secondary_table_microsoft_endpoint = (known after apply)
          + secondary_table_microsoft_host     = (known after apply)
          + secondary_web_endpoint             = (known after apply)
          + secondary_web_host                 = (known after apply)
          + secondary_web_internet_endpoint    = (known after apply)
          + secondary_web_internet_host        = (known after apply)
          + secondary_web_microsoft_endpoint   = (known after apply)
          + secondary_web_microsoft_host       = (known after apply)
          + sftp_enabled                       = (known after apply)
          + shared_access_key_enabled          = (known after apply)
          + table_encryption_key_type          = (known after apply)
          + tags                               = (known after apply)
        } -> (known after apply)

      ~ static_website {
          + access_tier                        = (known after apply)
          + account_kind                       = (known after apply)
          + account_replication_type           = (known after apply)
          + account_tier                       = (known after apply)
          + allow_nested_items_to_be_public    = (known after apply)
          + allowed_copy_scope                 = (known after apply)
          + cross_tenant_replication_enabled   = (known after apply)
          + default_to_oauth_authentication    = (known after apply)
          + dns_endpoint_type                  = (known after apply)
          + edge_zone                          = (known after apply)
          + https_traffic_only_enabled         = (known after apply)
          + id                                 = (known after apply)
          + infrastructure_encryption_enabled  = (known after apply)
          + is_hns_enabled                     = (known after apply)
          + large_file_share_enabled           = (known after apply)
          + local_user_enabled                 = (known after apply)
          + location                           = (known after apply)
          + min_tls_version                    = (known after apply)
          + name                               = (known after apply)
          + nfsv3_enabled                      = (known after apply)
          + primary_access_key                 = (known after apply)
          + primary_blob_connection_string     = (known after apply)
          + primary_blob_endpoint              = (known after apply)
          + primary_blob_host                  = (known after apply)
          + primary_blob_internet_endpoint     = (known after apply)
          + primary_blob_internet_host         = (known after apply)
          + primary_blob_microsoft_endpoint    = (known after apply)
          + primary_blob_microsoft_host        = (known after apply)
          + primary_connection_string          = (known after apply)
          + primary_dfs_endpoint               = (known after apply)
          + primary_dfs_host                   = (known after apply)
          + primary_dfs_internet_endpoint      = (known after apply)
          + primary_dfs_internet_host          = (known after apply)
          + primary_dfs_microsoft_endpoint     = (known after apply)
          + primary_dfs_microsoft_host         = (known after apply)
          + primary_file_endpoint              = (known after apply)
          + primary_file_host                  = (known after apply)
          + primary_file_internet_endpoint     = (known after apply)
          + primary_file_internet_host         = (known after apply)
          + primary_file_microsoft_endpoint    = (known after apply)
          + primary_file_microsoft_host        = (known after apply)
          + primary_location                   = (known after apply)
          + primary_queue_endpoint             = (known after apply)
          + primary_queue_host                 = (known after apply)
          + primary_queue_microsoft_endpoint   = (known after apply)
          + primary_queue_microsoft_host       = (known after apply)
          + primary_table_endpoint             = (known after apply)
          + primary_table_host                 = (known after apply)
          + primary_table_microsoft_endpoint   = (known after apply)
          + primary_table_microsoft_host       = (known after apply)
          + primary_web_endpoint               = (known after apply)
          + primary_web_host                   = (known after apply)
          + primary_web_internet_endpoint      = (known after apply)
          + primary_web_internet_host          = (known after apply)
          + primary_web_microsoft_endpoint     = (known after apply)
          + primary_web_microsoft_host         = (known after apply)
          + provisioned_billing_model_version  = (known after apply)
          + public_network_access_enabled      = (known after apply)
          + queue_encryption_key_type          = (known after apply)
          + resource_group_name                = (known after apply)
          + secondary_access_key               = (known after apply)
          + secondary_blob_connection_string   = (known after apply)
          + secondary_blob_endpoint            = (known after apply)
          + secondary_blob_host                = (known after apply)
          + secondary_blob_internet_endpoint   = (known after apply)
          + secondary_blob_internet_host       = (known after apply)
          + secondary_blob_microsoft_endpoint  = (known after apply)
          + secondary_blob_microsoft_host      = (known after apply)
          + secondary_connection_string        = (known after apply)
          + secondary_dfs_endpoint             = (known after apply)
          + secondary_dfs_host                 = (known after apply)
          + secondary_dfs_internet_endpoint    = (known after apply)
          + secondary_dfs_internet_host        = (known after apply)
          + secondary_dfs_microsoft_endpoint   = (known after apply)
          + secondary_dfs_microsoft_host       = (known after apply)
          + secondary_file_endpoint            = (known after apply)
          + secondary_file_host                = (known after apply)
          + secondary_file_internet_endpoint   = (known after apply)
          + secondary_file_internet_host       = (known after apply)
          + secondary_file_microsoft_endpoint  = (known after apply)
          + secondary_file_microsoft_host      = (known after apply)
          + secondary_location                 = (known after apply)
          + secondary_queue_endpoint           = (known after apply)
          + secondary_queue_host               = (known after apply)
          + secondary_queue_microsoft_endpoint = (known after apply)
          + secondary_queue_microsoft_host     = (known after apply)
          + secondary_table_endpoint           = (known after apply)
          + secondary_table_host               = (known after apply)
          + secondary_table_microsoft_endpoint = (known after apply)
          + secondary_table_microsoft_host     = (known after apply)
          + secondary_web_endpoint             = (known after apply)
          + secondary_web_host                 = (known after apply)
          + secondary_web_internet_endpoint    = (known after apply)
          + secondary_web_internet_host        = (known after apply)
          + secondary_web_microsoft_endpoint   = (known after apply)
          + secondary_web_microsoft_host       = (known after apply)
          + sftp_enabled                       = (known after apply)
          + shared_access_key_enabled          = (known after apply)
          + table_encryption_key_type          = (known after apply)
          + tags                               = (known after apply)
        } -> (known after apply)

        # (3 unchanged blocks hidden)
    }

  # azurerm_storage_management_policy.platform_logs_archive_sea_01 will be created
  + resource "azurerm_storage_management_policy" "platform_logs_archive_sea_01" {
      + id                 = (known after apply)
      + storage_account_id = (known after apply)

      + rule {
          + enabled = true
          + name    = "diag-cool-cold-archive-delete"

          + actions {
              + base_blob {
                  + delete_after_days_since_creation_greater_than                  = -1
                  + delete_after_days_since_last_access_time_greater_than          = -1
                  + delete_after_days_since_modification_greater_than              = 365
                  + tier_to_archive_after_days_since_creation_greater_than         = -1
                  + tier_to_archive_after_days_since_last_access_time_greater_than = -1
                  + tier_to_archive_after_days_since_last_tier_change_greater_than = -1
                  + tier_to_archive_after_days_since_modification_greater_than     = 90
                  + tier_to_cold_after_days_since_creation_greater_than            = -1
                  + tier_to_cold_after_days_since_last_access_time_greater_than    = -1
                  + tier_to_cold_after_days_since_modification_greater_than        = 30
                  + tier_to_cool_after_days_since_creation_greater_than            = -1
                  + tier_to_cool_after_days_since_last_access_time_greater_than    = -1
                  + tier_to_cool_after_days_since_modification_greater_than        = -1
                }
            }

          + filters {
              + blob_types = [
                  + "blockBlob",
                ]
            }
        }
    }

Plan: 2 to add, 0 to change, 2 to destroy.
```
